1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_СкладскиеСекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыСкладскихСекций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоАдресов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Места</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретРазмещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяГлубинаНеОграничена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяГлубинаНеОграничена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйВесПодъёмаНаЭтаж</Name>
					<Comment>Максимальный вес, который может поднять штабелёр на этаж</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗазорПоШирине</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_СкладскиеСекции/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
			   
#Область ПрограммныйИнтерфейс  
			   
			   
			   
#КонецОбласти
			   
#Область ОбработчикиСобытий
			   
			   
Процедура ПередЗаписью(Отказ)
	
		Код = СтрШаблон("Р%1-М(%2-%3-%4)-Э%5"
		,Ряд
		,Формат(Место,"ЧЦ=2; ЧВН=")
		,Формат(Место+1,"ЧЦ=2; ЧВН=")
		,Формат(Место+2,"ЧЦ=2; ЧВН=")
		,Формат(Этаж,"ЧЦ=2; ЧВН=")); 
		
		Наименование = СтрШаблон("Р%1-М(%2)-Э%3",Ряд,Места,Этаж); 
		
		// При любом изменении секции (кроме первого создания) — инкремент версии
	Если НЕ ЭтоНовый() Тогда

		// Проверяем, изменились ли критичные поля
		ЕстьИзменения = Ложь;

		Попытка
			// Получаем текущие данные из базы
			СтарыеДанные = Ссылка.ПолучитьОбъект();

			// Критичные поля для snapshot'а:
			Если СтарыеДанные.Типоразмер <> Типоразмер
				ИЛИ СтарыеДанные.ЗапретРазмещения <> ЗапретРазмещения
				ИЛИ СтарыеДанные.МаксимальныйВесПодъёмаНаЭтаж <> МаксимальныйВесПодъёмаНаЭтаж
				ИЛИ СтарыеДанные.ЗазорПоШирине <> ЗазорПоШирине Тогда

				ЕстьИзменения = Истина;
			КонецЕсли;

		Исключение
			// Если не удалось получить старые данные — инкрементируем на всякий случай
			ЕстьИзменения = Истина;
		КонецПопытки;

		Если ЕстьИзменения Тогда
			Версия = Версия + 1;
		КонецЕсли;

	Иначе
		// Первое создание — версия 1
		Если НЕ ЗначениеЗаполнено(Версия) Тогда
			Версия = 1;
		КонецЕсли;
	КонецЕсли;
	
// ═══════════════════════════════════════════════════════════════════════════
// ПРИМЕЧАНИЕ:
// ═══════════════════════════════════════════════════════════════════════════
//
// Версия инкрементируется только при изменении полей, влияющих на размещение:
// - Типоразмер (ширина/высота/глубина/вес)
// - ЗапретРазмещения
// - МаксимальныйВесПодъёмаНаЭтаж
// - ЗазорПоШирине
//
// НЕ инкрементируется при изменении:
// - Наименование, Код (административные поля)
// - ВремяДоступа, УровеньДоступа (приоритизация, не физика)
// - Адрес1/2/3 (они меняются через документы перемещения паллет)

		

КонецПроцедуры
			   
#КонецОбласти
			   
#Область СлужебныеПроцедурыИФункции
			   
#КонецОбласти
			   
			   
#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
			   |en = 'Invalid object call on the client.'");

#КонецЕсли
